In [1]:
import numpy as np

import pandas as pd

# Object creation

In [2]:
s = pd.Series([1,3,5,np.nan,2,4])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    2.0
5    4.0
dtype: float64

In [3]:
dates =pd.date_range("20130101",periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(24).reshape((6,4)),index=dates,columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -1.578203 -1.195208 -0.829927  0.548187
2013-01-02 -0.592986  0.095768  2.255046  0.728883
2013-01-03  0.291284  0.841913  0.659288  0.576261
2013-01-04 -0.211887  0.607046  0.742873  1.392586
2013-01-05  0.008251 -0.658149 -0.902642 -1.035780
2013-01-06 -1.456230 -0.751423 -1.480654 -1.157069

In [5]:
dict_content={
    "A":1.0,
    "B":pd.Timestamp("2013-01-02"),
    "C":pd.Series(1,index=np.random.permutation(4),dtype="float32"),
    "D":pd.array([3]*4,dtype="int8"),
    "E":["test", "train"]*2,
    "F":"foo"
}
dict_content

{'A': 1.0,
 'B': Timestamp('2013-01-02 00:00:00'),
 'C': 1    1.0
 2    1.0
 3    1.0
 0    1.0
 dtype: float32,
 'D': <PandasArray>
 [3, 3, 3, 3]
 Length: 4, dtype: int8,
 'E': ['test', 'train', 'test', 'train'],
 'F': 'foo'}

In [6]:
df2 = pd.DataFrame(dict_content)
df2

     A          B    C  D      E    F
1  1.0 2013-01-02  1.0  3   test  foo
2  1.0 2013-01-02  1.0  3  train  foo
3  1.0 2013-01-02  1.0  3   test  foo
0  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df2.sort_index()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3  train  foo
1  1.0 2013-01-02  1.0  3   test  foo
2  1.0 2013-01-02  1.0  3  train  foo
3  1.0 2013-01-02  1.0  3   test  foo

In [8]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D              int8
E            object
F            object
dtype: object

# Viewing data

In [9]:
df.head(2)

                   A         B         C         D
2013-01-01 -1.578203 -1.195208 -0.829927  0.548187
2013-01-02 -0.592986  0.095768  2.255046  0.728883

In [10]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.211887  0.607046  0.742873  1.392586
2013-01-05  0.008251 -0.658149 -0.902642 -1.035780
2013-01-06 -1.456230 -0.751423 -1.480654 -1.157069

In [11]:
df.index,df.columns

(DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
                '2013-01-05', '2013-01-06'],
               dtype='datetime64[ns]', freq='D'),
 Index(['A', 'B', 'C', 'D'], dtype='object'))

In [12]:
df.to_numpy()

array([[-1.5782031 , -1.19520821, -0.82992666,  0.54818651],
       [-0.59298602,  0.095768  ,  2.25504581,  0.72888349],
       [ 0.29128391,  0.84191306,  0.65928825,  0.57626071],
       [-0.21188684,  0.60704625,  0.74287314,  1.39258605],
       [ 0.00825077, -0.65814935, -0.90264223, -1.03577951],
       [-1.45622987, -0.75142267, -1.480654  , -1.15706874]])

In [13]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [14]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.589962 -0.176675  0.073997  0.175511
std    0.775170  0.815540  1.395333  1.032470
min   -1.578203 -1.195208 -1.480654 -1.157069
25%   -1.240419 -0.728104 -0.884463 -0.639788
50%   -0.402436 -0.281191 -0.085319  0.562224
75%   -0.046784  0.479227  0.721977  0.690728
max    0.291284  0.841913  2.255046  1.392586

In [15]:
df2.sort_values(by="E")

     A          B    C  D      E    F
1  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3   test  foo
2  1.0 2013-01-02  1.0  3  train  foo
0  1.0 2013-01-02  1.0  3  train  foo

In [16]:
df.sort_index(ascending=False)

                   A         B         C         D
2013-01-06 -1.456230 -0.751423 -1.480654 -1.157069
2013-01-05  0.008251 -0.658149 -0.902642 -1.035780
2013-01-04 -0.211887  0.607046  0.742873  1.392586
2013-01-03  0.291284  0.841913  0.659288  0.576261
2013-01-02 -0.592986  0.095768  2.255046  0.728883
2013-01-01 -1.578203 -1.195208 -0.829927  0.548187

# Selection

## Getting

In [17]:
df

                   A         B         C         D
2013-01-01 -1.578203 -1.195208 -0.829927  0.548187
2013-01-02 -0.592986  0.095768  2.255046  0.728883
2013-01-03  0.291284  0.841913  0.659288  0.576261
2013-01-04 -0.211887  0.607046  0.742873  1.392586
2013-01-05  0.008251 -0.658149 -0.902642 -1.035780
2013-01-06 -1.456230 -0.751423 -1.480654 -1.157069

In [18]:
df["A"]

2013-01-01   -1.578203
2013-01-02   -0.592986
2013-01-03    0.291284
2013-01-04   -0.211887
2013-01-05    0.008251
2013-01-06   -1.456230
Freq: D, Name: A, dtype: float64

In [19]:
#df[0]

In [20]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.578203 -1.195208 -0.829927  0.548187
2013-01-02 -0.592986  0.095768  2.255046  0.728883
2013-01-03  0.291284  0.841913  0.659288  0.576261

In [21]:
df["1/1/2013":"1/4/2013"]

                   A         B         C         D
2013-01-01 -1.578203 -1.195208 -0.829927  0.548187
2013-01-02 -0.592986  0.095768  2.255046  0.728883
2013-01-03  0.291284  0.841913  0.659288  0.576261
2013-01-04 -0.211887  0.607046  0.742873  1.392586

In [22]:
df["2013-1-1":"1/4/2013"]

                   A         B         C         D
2013-01-01 -1.578203 -1.195208 -0.829927  0.548187
2013-01-02 -0.592986  0.095768  2.255046  0.728883
2013-01-03  0.291284  0.841913  0.659288  0.576261
2013-01-04 -0.211887  0.607046  0.742873  1.392586

## Selection by label

In [23]:
df

                   A         B         C         D
2013-01-01 -1.578203 -1.195208 -0.829927  0.548187
2013-01-02 -0.592986  0.095768  2.255046  0.728883
2013-01-03  0.291284  0.841913  0.659288  0.576261
2013-01-04 -0.211887  0.607046  0.742873  1.392586
2013-01-05  0.008251 -0.658149 -0.902642 -1.035780
2013-01-06 -1.456230 -0.751423 -1.480654 -1.157069

In [24]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [25]:
df.loc[dates[0]]

A   -1.578203
B   -1.195208
C   -0.829927
D    0.548187
Name: 2013-01-01 00:00:00, dtype: float64

In [26]:
df.loc["2013/1/1"]

A   -1.578203
B   -1.195208
C   -0.829927
D    0.548187
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01 -1.578203 -1.195208
2013-01-02 -0.592986  0.095768
2013-01-03  0.291284  0.841913
2013-01-04 -0.211887  0.607046
2013-01-05  0.008251 -0.658149
2013-01-06 -1.456230 -0.751423

In [28]:
df.loc["2013/1/1":"2013/1/3",["A","B"]]

                   A         B
2013-01-01 -1.578203 -1.195208
2013-01-02 -0.592986  0.095768
2013-01-03  0.291284  0.841913

In [29]:
df.loc[["2013/1/1","2013/1/3"],["A","B"]]

                   A         B
2013-01-01 -1.578203 -1.195208
2013-01-03  0.291284  0.841913

In [30]:
df.loc["1-1-2013","A"]

-1.5782030971525762

## Selection by position

In [31]:
df.iloc[0]

A   -1.578203
B   -1.195208
C   -0.829927
D    0.548187
Name: 2013-01-01 00:00:00, dtype: float64

In [32]:
df.iloc[0:3,[0,2]]

                   A         C
2013-01-01 -1.578203 -0.829927
2013-01-02 -0.592986  2.255046
2013-01-03  0.291284  0.659288

In [33]:
df.iloc[[1,3],[0,2]]

                   A         C
2013-01-02 -0.592986  2.255046
2013-01-04 -0.211887  0.742873

In [34]:
df.iloc[:,2:4]

                   C         D
2013-01-01 -0.829927  0.548187
2013-01-02  2.255046  0.728883
2013-01-03  0.659288  0.576261
2013-01-04  0.742873  1.392586
2013-01-05 -0.902642 -1.035780
2013-01-06 -1.480654 -1.157069

## Boolean indexing

In [35]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN  0.548187
2013-01-02       NaN  0.095768  2.255046  0.728883
2013-01-03  0.291284  0.841913  0.659288  0.576261
2013-01-04       NaN  0.607046  0.742873  1.392586
2013-01-05  0.008251       NaN       NaN       NaN
2013-01-06       NaN       NaN       NaN       NaN

In [36]:
df[df["A"]>0],df[df["B"]>0]

(                   A         B         C         D
 2013-01-03  0.291284  0.841913  0.659288  0.576261
 2013-01-05  0.008251 -0.658149 -0.902642 -1.035780,
                    A         B         C         D
 2013-01-02 -0.592986  0.095768  2.255046  0.728883
 2013-01-03  0.291284  0.841913  0.659288  0.576261
 2013-01-04 -0.211887  0.607046  0.742873  1.392586)

In [37]:
df2 = df.copy()

In [38]:
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01 -1.578203 -1.195208 -0.829927  0.548187    one
2013-01-02 -0.592986  0.095768  2.255046  0.728883    one
2013-01-03  0.291284  0.841913  0.659288  0.576261    two
2013-01-04 -0.211887  0.607046  0.742873  1.392586  three
2013-01-05  0.008251 -0.658149 -0.902642 -1.035780   four
2013-01-06 -1.456230 -0.751423 -1.480654 -1.157069  three

In [39]:
df2[df2["E"].isin(["one"])]

                   A         B         C         D    E
2013-01-01 -1.578203 -1.195208 -0.829927  0.548187  one
2013-01-02 -0.592986  0.095768  2.255046  0.728883  one

## Setting

In [40]:
s1 = pd.Series(np.arange(6),index=pd.date_range("2013-1-2",periods=6))
s1

2013-01-02    0
2013-01-03    1
2013-01-04    2
2013-01-05    3
2013-01-06    4
2013-01-07    5
Freq: D, dtype: int32

In [41]:
df

                   A         B         C         D
2013-01-01 -1.578203 -1.195208 -0.829927  0.548187
2013-01-02 -0.592986  0.095768  2.255046  0.728883
2013-01-03  0.291284  0.841913  0.659288  0.576261
2013-01-04 -0.211887  0.607046  0.742873  1.392586
2013-01-05  0.008251 -0.658149 -0.902642 -1.035780
2013-01-06 -1.456230 -0.751423 -1.480654 -1.157069

In [42]:
df.at[dates[0],"A"] = 0
df.iat[0,1]=0

In [43]:
df["D"] = 5
df.loc[:,"D"] = np.array([5]*len(df))
df

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.829927  5
2013-01-02 -0.592986  0.095768  2.255046  5
2013-01-03  0.291284  0.841913  0.659288  5
2013-01-04 -0.211887  0.607046  0.742873  5
2013-01-05  0.008251 -0.658149 -0.902642  5
2013-01-06 -1.456230 -0.751423 -1.480654  5

In [44]:
df["F"] = s1
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.829927  5  NaN
2013-01-02 -0.592986  0.095768  2.255046  5  0.0
2013-01-03  0.291284  0.841913  0.659288  5  1.0
2013-01-04 -0.211887  0.607046  0.742873  5  2.0
2013-01-05  0.008251 -0.658149 -0.902642  5  3.0
2013-01-06 -1.456230 -0.751423 -1.480654  5  4.0

In [45]:
df2 = df.copy()
df2[df2>0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.829927 -5  NaN
2013-01-02 -0.592986 -0.095768 -2.255046 -5  0.0
2013-01-03 -0.291284 -0.841913 -0.659288 -5 -1.0
2013-01-04 -0.211887 -0.607046 -0.742873 -5 -2.0
2013-01-05 -0.008251 -0.658149 -0.902642 -5 -3.0
2013-01-06 -1.456230 -0.751423 -1.480654 -5 -4.0

# Missing data

In [46]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+["E"])
df1.iloc[0:2,5]=1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.829927  5  NaN  1.0
2013-01-02 -0.592986  0.095768  2.255046  5  0.0  1.0
2013-01-03  0.291284  0.841913  0.659288  5  1.0  NaN
2013-01-04 -0.211887  0.607046  0.742873  5  2.0  NaN

In [47]:
df1.dropna(how="any")

                   A         B         C  D    F    E
2013-01-02 -0.592986  0.095768  2.255046  5  0.0  1.0

In [48]:
df1.fillna(5)
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.829927  5  5.0  1.0
2013-01-02 -0.592986  0.095768  2.255046  5  0.0  1.0
2013-01-03  0.291284  0.841913  0.659288  5  1.0  5.0
2013-01-04 -0.211887  0.607046  0.742873  5  2.0  5.0

In [49]:
df1.isna()

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [50]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Operations

### Stats
Operations in general exclude missing data.

In [51]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.829927  5  NaN
2013-01-02 -0.592986  0.095768  2.255046  5  0.0
2013-01-03  0.291284  0.841913  0.659288  5  1.0
2013-01-04 -0.211887  0.607046  0.742873  5  2.0
2013-01-05  0.008251 -0.658149 -0.902642  5  3.0
2013-01-06 -1.456230 -0.751423 -1.480654  5  4.0

In [53]:
df.mean(0)

A   -0.326928
B    0.022526
C    0.073997
D    5.000000
F    2.000000
dtype: float64

In [54]:
df.mean(1)

2013-01-01    1.042518
2013-01-02    1.351566
2013-01-03    1.558497
2013-01-04    1.627607
2013-01-05    1.289492
2013-01-06    1.062339
Freq: D, dtype: float64

In [57]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

### Apply

In [59]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -0.829927   5   NaN
2013-01-02 -0.592986  0.095768  1.425119  10   0.0
2013-01-03 -0.301702  0.937681  2.084407  15   1.0
2013-01-04 -0.513589  1.544727  2.827281  20   3.0
2013-01-05 -0.505338  0.886578  1.924638  25   6.0
2013-01-06 -1.961568  0.135155  0.443984  30  10.0

In [60]:
df.apply(lambda x: x.max() - x.min())

A    1.747514
B    1.593336
C    3.735700
D    0.000000
F    4.000000
dtype: float64